OdDAI.UnderlyingType.domain
\details
Retrieves the domain of the defined data type.
\returns A smart pointer to the underlying type of the defined type.

OdDAI.UnderlyingType.isConstructedType
\details
Determines whether the underlying data type is a constructed data type.
\returns true if the underlying data type is a constructed data type; otherwise, the method returns false.

OdDAI.UnderlyingType.isDefinedType
\details
Determines whether the underlying data type is a defined data type.
\returns true if the underlying data type is a defined data type; otherwise, the method returns false.

OdDAI.UnderlyingType.isAggregationType
\details
Determines whether the underlying data type is an aggregation data type.
\returns true if the underlying data type is an aggregation data type; otherwise, the method returns false.

OdDAI.UnderlyingType.isSimpleType
\details
Determines whether the underlying data type is a simple data type.
\returns true if the underlying data type is a simple data type; otherwise, the method returns false.

OdDAI.UnderlyingType.unset
\details
Resets the underlying data type for the object.

OdDAI.UnderlyingType.exists
\details
Retrieves whether the underlying data type is set for the UnderlyingType object.
\returns true if the underlying data type is specified; otherwise, the method returns false.

OdDAI.UnderlyingType.#ctor
\details
Creates a new underlying data type definition with unset nested data type inside.

OdDAI.UnderlyingType
\details
A class that implements storing definitions of IFC underlying data types:
* Simple types.
* Aggregation types.
* Defined types.
* Constructed types.
\sa
IFC Data Types.